-- phpMyAdmin SQL Dump
-- version 4.5.1
-- http://www.phpmyadmin.net
--
-- 主機: 127.0.0.1
-- 產生時間： 2017-01-25 11:14:04
-- 伺服器版本: 10.1.8-MariaDB
-- PHP 版本： 5.5.30

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `on_sale`
--
CREATE DATABASE IF NOT EXISTS `on_sale` DEFAULT CHARACTER SET armscii8 COLLATE armscii8_general_ci;
USE `on_sale`;

-- --------------------------------------------------------

--
-- 資料表結構 `manger`
--

CREATE TABLE `manger` (
  `Man_id` varchar(10) CHARACTER SET utf8 NOT NULL COMMENT '帳號',
  `Password` varchar(10) CHARACTER SET utf8 NOT NULL COMMENT '密碼'
) ENGINE=InnoDB DEFAULT CHARSET=armscii8;

--
-- 資料表的匯出資料 `manger`
--

INSERT INTO `manger` (`Man_id`, `Password`) VALUES
('Admin', '731012');

-- --------------------------------------------------------

--
-- 資料表結構 `order_b`
--

CREATE TABLE `order_b` (
  `id` int(255) NOT NULL,
  `odd_n` varchar(13) NOT NULL COMMENT '單號',
  `odd_d` varchar(20) CHARACTER SET utf8 NOT NULL COMMENT '品名',
  `odd_m` varchar(20) CHARACTER SET utf8 NOT NULL COMMENT '數量'
) ENGINE=InnoDB DEFAULT CHARSET=armscii8;

--
-- 資料表的匯出資料 `order_b`
--

INSERT INTO `order_b` (`id`, `odd_n`, `odd_d`, `odd_m`) VALUES
(1, '201308050001', 'fdff', '5'),
(2, '201308060002', 'fdf', '25'),
(3, '201308270001', '水果', '77'),
(4, '201612290014', '', ''),
(5, '201612290014', '', ''),
(6, '201612290014', '套子', '5'),
(7, '201612290014', '手槍', '10'),
(8, '201612290014', '套子', '5'),
(9, '201612290014', '手槍', '10'),
(10, '201612290014', '包皮', '5'),
(11, '201612290014', '內褲', '10'),
(12, '201612290015', '保險套', '5'),
(13, '201612290015', '內衣', '5'),
(14, '201612290016', '潤滑劑', '5'),
(15, '201612290016', '岡本003', '10'),
(16, '201612290016', '杜雷斯', '6'),
(17, '201612290016', '假面騎士一號', '5'),
(18, '201612290016', '價面騎士W', '2'),
(19, '201612290016', '假面騎士OOO', '4'),
(20, '201612290016', '假面騎士DEN O', '56'),
(21, '201612290018', '套子', '5'),
(22, '201612300001', '套子', '99'),
(23, '201612300002', '套子', '99'),
(24, '201612300003', '套子', '99'),
(25, '201612300007', '套子', '58'),
(26, '201612300008', '套子', '58'),
(27, '201612300009', '套子', '58'),
(28, '201612300010', '套子441414', '58'),
(29, '201612300011', '主機', '5'),
(30, '201612300011', '螢幕', '20'),
(31, '201612300012', '保險套', '5'),
(32, '201612300012', '內衣', '35'),
(33, '201612300013', '保險套', '5'),
(34, '201612300013', '內衣', '35'),
(35, '201612300014', '保險套', '5'),
(36, '201612300014', '內衣', '35'),
(37, '201612300015', '保險套', '5'),
(38, '201612300015', '內衣', '35'),
(39, '201612300016', '保險套', '5'),
(40, '201612300016', '內衣', '35'),
(41, '201612300017', '保險套', '5'),
(42, '201612300017', '內衣', '35'),
(43, '201612300018', '保險套', '5'),
(44, '201612300018', '內衣', '35'),
(45, '201612300019', '保險套', '5'),
(46, '201612300019', '內衣', '35'),
(47, '201612300020', '保險套', '5'),
(48, '201612300020', '內衣', '35'),
(49, '201612300021', '保險套', '5'),
(50, '201612300021', '內衣', '35'),
(51, '201612300022', '保險套', '5'),
(52, '201612300022', '內衣', '35'),
(53, '201612300023', '保險套', '5'),
(54, '201612300023', '內衣', '35'),
(55, '201612300024', '套子', '99'),
(57, '201701110001', '3737', '9999'),
(58, '201701110002', '2424', '4444'),
(59, '201701110003', '444', '44'),
(60, '201701110004', '帥哥阿弟仔金城武', '22'),
(61, '201701110005', '套子441414', '888');

-- --------------------------------------------------------

--
-- 資料表結構 `order_h`
--

CREATE TABLE `order_h` (
  `order_id` int(255) NOT NULL COMMENT '流水號',
  `odd_n` char(13) CHARACTER SET utf8 NOT NULL COMMENT '訂單單號',
  `pay_t` varchar(4) CHARACTER SET utf8 NOT NULL COMMENT '付款方式',
  `bank_code` varchar(10) CHARACTER SET utf8 NOT NULL COMMENT '銀行代碼',
  `pay_m` varchar(10) CHARACTER SET utf8 NOT NULL COMMENT '金額',
  `b_5_code` varchar(5) CHARACTER SET utf8 NOT NULL COMMENT '末五碼',
  `buy_day` varchar(128) CHARACTER SET utf8 NOT NULL COMMENT '下標日',
  `go_day` varchar(128) CHARACTER SET utf8 NOT NULL COMMENT '希望到貨日',
  `acc_name` text CHARACTER SET utf8 NOT NULL COMMENT '下標帳號',
  `buyers` text CHARACTER SET utf8 NOT NULL COMMENT '姓名',
  `m_phone` varchar(10) CHARACTER SET utf8 NOT NULL COMMENT '手機',
  `h_phone` varchar(10) CHARACTER SET utf8 NOT NULL COMMENT '市話',
  `mail` text CHARACTER SET utf8 NOT NULL COMMENT '電子信箱',
  `go_add` text CHARACTER SET utf8 NOT NULL COMMENT '地址',
  `remark` text CHARACTER SET utf8 NOT NULL COMMENT '備註',
  `odd_type` int(1) NOT NULL DEFAULT '0' COMMENT '訂單狀態'
) ENGINE=InnoDB DEFAULT CHARSET=armscii8;

--
-- 資料表的匯出資料 `order_h`
--

INSERT INTO `order_h` (`order_id`, `odd_n`, `pay_t`, `bank_code`, `pay_m`, `b_5_code`, `buy_day`, `go_day`, `acc_name`, `buyers`, `m_phone`, `h_phone`, `mail`, `go_add`, `remark`, `odd_type`) VALUES
(1, '201308050001', '貨到付款', '700 中華郵政', '215', '5565', '20130805', '20130705', 'rex', 'rex', '123', '12333', '1233', '台北市103大同區dfdfd', 'dfd', 0),
(3, '201308060002', '銀行轉帳', '158 彰化一信', '25', '25552', '20130806', '20130706', 'rex111', 'rex111', '123456', '123456', '322', '新北市207萬里區fdf', 'dfdfdf', 0),
(4, '201308270001', '貨到付款', '151 第七商銀', '888', '66666', '20130827', '20130827', 'yamaha', 'tom', '0936897835', '0936897835', 'tom@gmail.com', '雲林縣649二崙鄉集集街75號', '請盡快幫我寄出', 0),
(5, '201612290001', '貨到付款', '151 第七商銀', '350', '22531', '1482940800', '1483027200', 'pcpsdc2001', '阿弟仔', '0936389385', '0936389385', 'pcpsdc2001@yahoo.com.tw', '台中市408南屯區中和里黎明路一段123巷30號', '', 0),
(6, '201612290002', '銀行轉帳', '101 台北一信', '350', '22531', '1482940800', '1483027200', 'pcpsdc2001', '阿弟仔', '0936389385', '0936389385', 'pcpsdc2001@yahoo.com.tw', '台中市中和里黎明路一段123巷30號', '', 0),
(7, '201612290003', '銀行轉帳', '101 台北一信', '350', '22531', '1482940800', '1483027200', 'pcpsdc2001', '阿弟仔', '0936389385', '0936389385', 'pcpsdc2001@yahoo.com.tw', '台中市中和里黎明路一段123巷30號', '', 0),
(8, '201612290004', '銀行轉帳', '101 台北一信', '350', '22531', '1482940800', '1483027200', 'pcpsdc2001', '阿弟仔', '0936389385', '0936389385', 'pcpsdc2001@yahoo.com.tw', '台中市中和里黎明路一段123巷30號', '', 0),
(9, '201612290005', '銀行轉帳', '101 台北一信', '350', '22531', '1482940800', '1483027200', 'pcpsdc2001', '阿弟仔', '0936389385', '0936389385', 'pcpsdc2001@yahoo.com.tw', '台中市中和里黎明路一段123巷30號', '', 0),
(10, '201612290006', '銀行轉帳', '101 台北一信', '350', '22531', '1482940800', '1483027200', 'pcpsdc2001', '阿弟仔', '0936389385', '0936389385', 'pcpsdc2001@yahoo.com.tw', '台中市中和里黎明路一段123巷30號', '', 0),
(11, '201612290007', '銀行轉帳', '101 台北一信', '350', '22531', '1482940800', '1483027200', 'pcpsdc2001', '阿弟仔', '0936389385', '0936389385', 'pcpsdc2001@yahoo.com.tw', '台中市中和里黎明路一段123巷30號', '', 0),
(12, '201612290008', '銀行轉帳', '101 台北一信', '350', '22531', '1482940800', '1483027200', 'pcpsdc2001', '阿弟仔', '0936389385', '0936389385', 'pcpsdc2001@yahoo.com.tw', '台中市中和里黎明路一段123巷30號', '', 0),
(13, '201612290009', '銀行轉帳', '101 台北一信', '350', '22531', '1482940800', '1483027200', 'pcpsdc2001', '阿弟仔', '0936389385', '0936389385', 'pcpsdc2001@yahoo.com.tw', '台中市中和里黎明路一段123巷30號', '', 0),
(14, '201612290010', '銀行轉帳', '101 台北一信', '350', '22531', '1482940800', '1483027200', 'pcpsdc2001', '阿弟仔', '0936389385', '0936389385', 'pcpsdc2001@yahoo.com.tw', '台中市中和里黎明路一段123巷30號', '', 0),
(15, '201612290011', '銀行轉帳', '101 台北一信', '350', '22531', '1482940800', '1483027200', 'pcpsdc2001', '阿弟仔', '0936389385', '0936389385', 'pcpsdc2001@yahoo.com.tw', '台中市中和里黎明路一段123巷30號', '', 0),
(16, '201612290012', '銀行轉帳', '101 台北一信', '350', '22531', '1482940800', '1483027200', 'pcpsdc2001', '阿弟仔', '0936389385', '0936389385', 'pcpsdc2001@yahoo.com.tw', '台中市中和里黎明路一段123巷30號', '', 0),
(17, '201612290013', '銀行轉帳', '101 台北一信', '350', '22531', '1482940800', '1483027200', 'pcpsdc2001', '阿弟仔', '0936389385', '0936389385', 'pcpsdc2001@yahoo.com.tw', '台中市中和里黎明路一段123巷30號', '', 0),
(18, '201612290014', '銀行轉帳', '101 台北一信', '350', '22531', '1482940800', '1483027200', 'pcpsdc2001', '阿弟仔', '0936389385', '0936389385', 'pcpsdc2001@yahoo.com.tw', '台中市中和里黎明路一段123巷30號', '', 0),
(19, '201612290015', '貨到付款', '147 三信銀行', '500', '12345', '1482940800', '1482940800', 'pcpsdc2001', '阿弟仔', '0936389385', '0936389385', 'pcpsdc2001@yahoo.com.tw', '台東縣951綠島鄉中和里黎明路一段123巷30號', '5555', 0),
(20, '201612290016', '銀行轉帳', '825 慶豐銀行', '350', '95431', '1482940800', '1483113600', '帥哥一號', '金城武', '0936389385', '24793649', 'tsunghsien1012@gmail.com', '台中市400中區綠川東街32號8F-21', '盡快寄出', 0),
(21, '201612290017', '銀行轉帳', '700 中華郵政', '2', '3', '1482940800', '1482940800', 'pcpsdc2001', '阿弟仔', '0936389385', '0936389385', 'pcpsdc2001@yahoo.com.tw', '新北市208金山區中和里黎明路一段123巷30號', '', 0),
(22, '201612290018', '銀行轉帳', '151 第七商銀', '350', '22531', '1482681600', '1482940800', 'pcpsdc2001', '阿弟仔', '0936389385', '0936389385', 'pcpsdc2001@yahoo.com.tw', '花蓮縣971新城鄉中和里黎明路一段123巷30號', '', 0),
(23, '201612300001', '貨到付款', '700 中華郵政', '350', '22531', '1483027200', '1483027200', 'pcpsdc2001', '阿弟仔', '0936389385', '0936389385', 'pcpsdc2001@yahoo.com.tw', '台東縣中和里黎明路一段123巷30號', '', 0),
(24, '201612300002', '貨到付款', '700 中華郵政', '350', '22531', '1483027200', '1483027200', 'pcpsdc2001', '阿弟仔', '0936389385', '0936389385', 'pcpsdc2001@yahoo.com.tw', '台東縣中和里黎明路一段123巷30號', '', 0),
(25, '201612300003', '貨到付款', '700 中華郵政', '350', '22531', '1483027200', '1483027200', 'pcpsdc2001', '阿弟仔', '0936389385', '0936389385', 'pcpsdc2001@yahoo.com.tw', '台東縣中和里黎明路一段123巷30號', '', 0),
(26, '201612300004', '貨到付款', '700 中華郵政', '350', '22531', '1483027200', '1483027200', 'pcpsdc2001', '阿弟仔', '0936389385', '0936389385', 'pcpsdc2001@yahoo.com.tw', '台東縣中和里黎明路一段123巷30號', '', 0),
(27, '201612300005', '貨到付款', '700 中華郵政', '350', '22531', '1483027200', '1483027200', 'pcpsdc2001', '阿弟仔', '0936389385', '0936389385', 'pcpsdc2001@yahoo.com.tw', '台東縣中和里黎明路一段123巷30號', '', 0),
(28, '201612300006', '貨到付款', '700 中華郵政', '350', '22531', '1483027200', '1483027200', 'pcpsdc2001', '阿弟仔', '0936389385', '0936389385', 'pcpsdc2001@yahoo.com.tw', '台東縣中和里黎明路一段123巷30號', '', 0),
(29, '201612300007', '貨到付款', '700 中華郵政', '350', '22531', '1483027200', '1483027200', 'pcpsdc2001', '阿弟仔', '0936389385', '0936389385', 'pcpsdc2001@yahoo.com.tw', '澎湖縣881西嶼鄉中和里黎明路一段123巷30號', '', 0),
(30, '201612300008', '貨到付款', '700 中華郵政', '350', '22531', '1483027200', '1483027200', 'pcpsdc2001', '阿弟仔', '0936389385', '0936389385', 'pcpsdc2001@yahoo.com.tw', '澎湖縣881西嶼鄉中和里黎明路一段123巷30號', '', 0),
(31, '201612300009', '貨到付款', '700 中華郵政', '350', '22531', '1483027200', '1483027200', 'pcpsdc2001', '阿弟仔', '0936389385', '0936389385', 'pcpsdc2001@yahoo.com.tw', '澎湖縣881西嶼鄉中和里黎明路一段123巷30號', '', 0),
(32, '201612300010', '貨到付款', '700 中華郵政', '350', '22531', '1483027200', '1483027200', 'pcpsdc2001', '阿弟仔', '0936389385', '0936389385', 'pcpsdc2001@yahoo.com.tw', '連江縣209南竿鄉中和里黎明路一段123巷30號', '', 0),
(33, '201612300011', '銀行轉帳', '001 中央信託', '999', '11012', '1483027200', '1484064000', 'pcpsdc2001', '阿弟仔rex', '0936389385', '24793649', 'tsunghsien1012@gmail.com', '台中市407西屯區綠川東街32號8F-21', '321', 0),
(34, '201612300012', '銀行轉帳', '146 台中二信', '999', '22531', '1483027200', '1454428800', '帥哥一號', '阿弟仔', '0936389385', '0936389385', 'pcpsdc2001@yahoo.com.tw', '台南市721麻豆區中和里黎明路一段123巷30號', '5555', 0),
(35, '201612300013', '銀行轉帳', '146 台中二信', '999', '22531', '1483027200', '1454428800', '帥哥一號', '阿弟仔', '0936389385', '0936389385', 'pcpsdc2001@yahoo.com.tw', '台南市中和里黎明路一段123巷30號', '5555', 0),
(36, '201612300014', '銀行轉帳', '146 台中二信', '999', '22531', '1483027200', '1454428800', '帥哥一號', '阿弟仔', '0936389385', '0936389385', 'pcpsdc2001@yahoo.com.tw', '台南市中和里黎明路一段123巷30號', '5555', 0),
(37, '201612300015', '銀行轉帳', '146 台中二信', '999', '22531', '1483027200', '1454428800', '帥哥一號', '阿弟仔', '0936389385', '0936389385', 'pcpsdc2001@yahoo.com.tw', '台南市中和里黎明路一段123巷30號', '5555', 0),
(38, '201612300016', '銀行轉帳', '146 台中二信', '999', '22531', '1483027200', '1454428800', '帥哥一號', '阿弟仔', '0936389385', '0936389385', 'pcpsdc2001@yahoo.com.tw', '台南市中和里黎明路一段123巷30號', '5555', 1),
(39, '201612300017', '銀行轉帳', '146 台中二信', '999', '22531', '1483027200', '1454428800', '帥哥一號', '阿弟仔', '0936389385', '0936389385', 'pcpsdc2001@yahoo.com.tw', '台南市中和里黎明路一段123巷30號', '5555', 0),
(40, '201612300018', '銀行轉帳', '146 台中二信', '999', '22531', '1483027200', '1454428800', '帥哥一號', '阿弟仔', '0936389385', '0936389385', 'pcpsdc2001@yahoo.com.tw', '台南市中和里黎明路一段123巷30號', '5555', 0),
(41, '201612300019', '銀行轉帳', '146 台中二信', '999', '22531', '1483027200', '1454428800', '帥哥一號', '阿弟仔', '0936389385', '0936389385', 'pcpsdc2001@yahoo.com.tw', '台南市中和里黎明路一段123巷30號', '5555', 0),
(42, '201612300020', '銀行轉帳', '146 台中二信', '999', '22531', '1481558400', '1455120000', '帥哥一號', '阿弟仔', '0936389385', '0936389385', 'pcpsdc2001@yahoo.com.tw', '台南市中和里黎明路一段123巷30號', '5555', 0),
(43, '201612300021', '銀行轉帳', '146 台中二信', '999', '22531', '1480521600', '1454860800', '帥哥一號', '阿弟仔', '0936389385', '0936389385', 'pcpsdc2001@yahoo.com.tw', '台南市中和里黎明路一段123巷30號', '5555', 0),
(44, '201612300022', '銀行轉帳', '146 台中二信', '999', '22531', '1480521600', '1454860800', '帥哥一號', '阿弟仔', '0936389385', '0936389385', 'pcpsdc2001@yahoo.com.tw', '台南市中和里黎明路一段123巷30號', '5555', 0),
(45, '201612300023', '銀行轉帳', '146 台中二信', '999', '22531', '1480521600', '1454860800', '帥哥一號', '阿弟仔', '0936389385', '0936389385', 'pcpsdc2001@yahoo.com.tw', '台南市中和里黎明路一段123巷30號', '5555', 0),
(46, '201612300024', '銀行轉帳', '162 彰化六信', '350', '22531', '1483027200', '1483027200', 'pcpsdc2001', '阿弟仔', '0936389385', '0936389385', 'pcpsdc2001@yahoo.com.tw', '花蓮縣971新城鄉中和里黎明路一段123巷30號', '45242', 1),
(48, '201701110001', '貨到付款', '147 三信銀行', '888', '36541', '20170111', '20170128', 'tsunghsien', '帥哥阿弟仔', '24793649', '24793649', 'tsunghsien1012@gmail.com', '彰化縣508和美鎮354353', '5373573', 0),
(49, '201701110002', '貨到付款', '147 三信銀行', '350', '22531', '20170111', '20170103', '帥哥一號24', '2424', '424', '242', '424242', '新北市208金山區中和里黎明路一段123巷30號', '42424', 0),
(50, '201701110003', '貨到付款', '147 三信銀行', '2', '22531', 'date(20170111)', 'date(20170111)', '帥哥一號2444', '阿弟仔', '0936389385', '0936389385', 'pcpsdc2001@yahoo.com.tw', '台北市100中正區綠川東街32號8F-21', '4242', 0),
(51, '201701110004', '面交', '700 中華郵政', '77', '77777', '20170111', '20170115', 'tsunghsien帥哥', '帥哥阿弟仔金城武', '0936389385', '0936389385', 'pcpsdc2001@yahoo.com.tw', '台北市103大同區綠川東街32號8F-21', '帥哥阿弟仔金城武', 0),
(52, '201701110005', '面交', '700 中華郵政', '350', '22531', '1484089200', '1484262000', 'tsunghsien帥哥456', '阿弟仔888', '0936389385', '0936389385', 'pcpsdc2001@yahoo.com.tw', '花蓮縣970花蓮市中和里黎明路一段123巷30號', '524253', 1);

--
-- 已匯出資料表的索引
--

--
-- 資料表索引 `manger`
--
ALTER TABLE `manger`
  ADD PRIMARY KEY (`Man_id`);

--
-- 資料表索引 `order_b`
--
ALTER TABLE `order_b`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `order_h`
--
ALTER TABLE `order_h`
  ADD PRIMARY KEY (`order_id`,`odd_n`);

--
-- 在匯出的資料表使用 AUTO_INCREMENT
--

--
-- 使用資料表 AUTO_INCREMENT `order_b`
--
ALTER TABLE `order_b`
  MODIFY `id` int(255) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=62;
--
-- 使用資料表 AUTO_INCREMENT `order_h`
--
ALTER TABLE `order_h`
  MODIFY `order_id` int(255) NOT NULL AUTO_INCREMENT COMMENT '流水號', AUTO_INCREMENT=53;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
